In [25]:
import pandas as pd
import numpy as np

In [38]:
data1 = pd.read_excel("data1.xlsx")

In [39]:
tmp = data1[data1['Rank']=='-'].reset_index(drop=True)
field = tmp.loc[::2, 'Field and institution'].reset_index(drop=True)
total = tmp.loc[::2, 'Doctorate recipients'].reset_index(drop=True)
top_20 = tmp.loc[1::2, 'Doctorate recipients'].reset_index(drop=True)

In [40]:
data1_total = pd.DataFrame(data = {'field': field, 'total': total, 'top_20': top_20})

In [41]:
data1_total

                                  field  total  top_20
0                         Life sciences  12592    3606
1  Physical sciences and earth sciences   6081    1868
2     Mathematics and computer sciences   3843    1117
3       Psychology and social sciences    9079    2259
4                          Engineering    9843    3760
5                             Education   4823    1376
6                  Humanities and arts    5290    1765
7                                 Other   3113     938

In [47]:
data1_col = data1[data1['Rank']!='-'].reset_index(drop=True)
data1_col[data1_col['Rank']==1]

               Field and institution Rank  Doctorate recipients
0                   Johns Hopkins U.    1                   244
20                       Stanford U.    1                   139
40                       Stanford U.    1                    84
61                         Walden U.    1                   260
81   Georgia Institute of Technology    1                   345
101         Columbia U., Teachers C.    1                   130
121                       Harvard U.    1                   141
141                        Walden U.    1                   133

In [48]:
data1_col['field'] = np.repeat(data1_total['field'], repeats=[20,20,21,20,20,20,20,20]).reset_index(drop=True)

In [50]:
data1_total.to_csv("data1_total.csv")
data1_col.to_csv("data1_col.csv")

In [75]:
data2 = pd.read_excel("data2.xlsx").loc[1:,].reset_index(drop=True)

In [78]:
def helper(i, x):
    tmp = data2.iloc[:, [0, 2*i+1, 2*i+2]]
    tmp.columns = ['State or location', 'Male', 'Female']
    tmp = tmp.melt(id_vars = 'State or location', var_name = 'sex')
    tmp["field"] = x
    return tmp

data2_all = pd.concat([helper(i, x) for i, x in enumerate(data2.columns[1::2])]).reset_index(drop=True)

In [79]:
data2_all.to_csv("data2_all.csv")